romkatv/powerlevel10k path:powerlevel10k.zsh-theme
zsh-users/zsh-autosuggestions
zdharma-continuum/fast-syntax-highlighting
softmoth/zsh-vim-mode
zsh-users/zsh-history-substring-search
MichaelAquilina/zsh-history-filter
ohmyzsh/ohmyzsh path:lib/directories.zsh
ohmyzsh/ohmyzsh path:plugins/common-aliases
